; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image1 - mode
	thermograph2 - mode
	thermograph0 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star1 - direction
	Star0 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 115)
	(= (data Planet5 image1) 200)
	(= (data Star6 image1) 115)
	(= (data Star7 image1) 247)
	(= (data Star8 image1) 290)
	(= (data Planet5 thermograph2) 117)
	(= (data Star6 thermograph2) 44)
	(= (data Star7 thermograph2) 201)
	(= (data Star8 thermograph2) 91)
	(= (data Planet5 thermograph0) 51)
	(= (data Star6 thermograph0) 56)
	(= (data Star7 thermograph0) 15)
	(= (data Star8 thermograph0) 207)
	(= (slew_time GroundStation2 Star0) 53.83)
	(= (slew_time Star0 GroundStation2) 53.83)
	(= (slew_time GroundStation2 Star1) 58.17)
	(= (slew_time Star1 GroundStation2) 58.17)
	(= (slew_time GroundStation3 Star0) 15.69)
	(= (slew_time Star0 GroundStation3) 15.69)
	(= (slew_time GroundStation3 Star1) 55.35)
	(= (slew_time Star1 GroundStation3) 55.35)
	(= (slew_time GroundStation3 GroundStation2) 10.37)
	(= (slew_time GroundStation2 GroundStation3) 10.37)
	(= (slew_time Star4 Star0) 73.42)
	(= (slew_time Star0 Star4) 73.42)
	(= (slew_time Star4 Star1) 16.47)
	(= (slew_time Star1 Star4) 16.47)
	(= (slew_time Star4 GroundStation2) 48.16)
	(= (slew_time GroundStation2 Star4) 48.16)
	(= (slew_time Star4 GroundStation3) 69.73)
	(= (slew_time GroundStation3 Star4) 69.73)
	(= (slew_time Star1 Star0) 11.65)
	(= (slew_time Star0 Star1) 11.65)
	(= (slew_time Planet5 Star0) 14.58)
	(= (slew_time Star0 Planet5) 14.58)
	(= (slew_time Planet5 Star1) 29.54)
	(= (slew_time Star1 Planet5) 29.54)
	(= (slew_time Planet5 GroundStation2) 14.39)
	(= (slew_time GroundStation2 Planet5) 14.39)
	(= (slew_time Planet5 GroundStation3) 13.2)
	(= (slew_time GroundStation3 Planet5) 13.2)
	(= (slew_time Planet5 Star4) 29.5)
	(= (slew_time Star4 Planet5) 29.5)
	(= (slew_time Star6 Star0) 5.101)
	(= (slew_time Star0 Star6) 5.101)
	(= (slew_time Star6 Star1) 7.914)
	(= (slew_time Star1 Star6) 7.914)
	(= (slew_time Star6 GroundStation2) 75.43)
	(= (slew_time GroundStation2 Star6) 75.43)
	(= (slew_time Star6 GroundStation3) 34.38)
	(= (slew_time GroundStation3 Star6) 34.38)
	(= (slew_time Star6 Star4) 17.43)
	(= (slew_time Star4 Star6) 17.43)
	(= (slew_time Star6 Planet5) 38.5)
	(= (slew_time Planet5 Star6) 38.5)
	(= (slew_time Star7 Star0) 9.689)
	(= (slew_time Star0 Star7) 9.689)
	(= (slew_time Star7 Star1) 49.23)
	(= (slew_time Star1 Star7) 49.23)
	(= (slew_time Star7 GroundStation2) 7.138)
	(= (slew_time GroundStation2 Star7) 7.138)
	(= (slew_time Star7 GroundStation3) 13.2)
	(= (slew_time GroundStation3 Star7) 13.2)
	(= (slew_time Star7 Star4) 50.69)
	(= (slew_time Star4 Star7) 50.69)
	(= (slew_time Star7 Planet5) 47.13)
	(= (slew_time Planet5 Star7) 47.13)
	(= (slew_time Star7 Star6) 58.35)
	(= (slew_time Star6 Star7) 58.35)
	(= (slew_time Star8 Star0) 59.77)
	(= (slew_time Star0 Star8) 59.77)
	(= (slew_time Star8 Star1) 24.13)
	(= (slew_time Star1 Star8) 24.13)
	(= (slew_time Star8 GroundStation2) 13.22)
	(= (slew_time GroundStation2 Star8) 13.22)
	(= (slew_time Star8 GroundStation3) 43.49)
	(= (slew_time GroundStation3 Star8) 43.49)
	(= (slew_time Star8 Star4) 38.22)
	(= (slew_time Star4 Star8) 38.22)
	(= (slew_time Star8 Planet5) 42.63)
	(= (slew_time Planet5 Star8) 42.63)
	(= (slew_time Star8 Star6) 60.78)
	(= (slew_time Star6 Star8) 60.78)
	(= (slew_time Star8 Star7) 94.26)
	(= (slew_time Star7 Star8) 94.26)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Star7 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 115 to 100.42, (fuel-used) from 0 to 14.58
   goals met: 0 of 2
2. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 100.42 to 90.731, (fuel-used) from 14.58 to 24.269
   goals met: 0 of 2
3. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 90.731 to 81.042, (fuel-used) from 24.269 to 33.958
   goals met: 0 of 2
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 2
5. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 2
6. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 81.042 to 71.353, (fuel-used) from 33.958 to 43.647
   goals met: 0 of 2
7. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 71.353 to 61.664, (fuel-used) from 43.647 to 53.336
   goals met: 0 of 2
8. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 0 of 2
9. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 61.664 to 51.975, (fuel-used) from 53.336 to 63.025
   goals met: 0 of 2
10. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 51.975 to 42.286, (fuel-used) from 63.025 to 72.714
   goals met: 0 of 2
11. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 2
12. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 2
13. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 42.286 to 32.597, (fuel-used) from 72.714 to 82.403
   goals met: 0 of 2
14. (take_image satellite0 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   changed: (data_capacity satellite0) from 1000 to 985, (data-stored) from 0 to 15
   goals met: 1 of 2
15. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 32.597 to 22.908, (fuel-used) from 82.403 to 92.092
   goals met: 1 of 2
16. (turn_to satellite0 star6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 22.908 to 17.807, (fuel-used) from 92.092 to 97.193
   goals met: 1 of 2
17. (turn_to satellite0 star4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 17.807 to 0.377, (fuel-used) from 97.193 to 114.623
   goals met: 2 of 2
